pbosman89/Wordclock/lpc13xx_lib/source/lpc13xx_syscon.c
    reg = LPC_SYSCON->PDRUNCFG & SYSCON_ABLOCK_BITMASK;
    reg |= 0x800;

    if (NewState == ENABLE) {
        LPC_SYSCON->PDRUNCFG = reg & ((~block) & SYSCON_ABLOCK_BITMASK);
    } else if (NewState == DISABLE) {
        LPC_SYSCON->PDRUNCFG = reg | (block & SYSCON_ABLOCK_BITMASK);
    }       
}


/*********************************************************************//**
 * @brief      Get Power state of analog blocks
 * @param[in]  block   Analog block, it can be
 *              - SYSCON_ABLOCK_IRCOUT : IRC oscillator output wake-up configuration
 *              - SYSCON_ABLOCK_IRC    : IRC oscillator power-down wake-up configuration 
 *              - SYSCON_ABLOCK_FLASH  : Flash wake-up configuration
 *              - SYSCON_ABLOCK_BOD    : BOD wake-up configuration
 *              - SYSCON_ABLOCK_ADC    : ADC wake-up configuration
 *              - SYSCON_ABLOCK_SYSOSC : System oscillator wake-up configuration
 *              - SYSCON_ABLOCK_WDTOSC : Watchdog oscillator wake-up configuration
 *              - SYSCON_ABLOCK_SYSPLL : System PLL wake-up configuration
 * @param[in]  None
 *             
 * @return     NewState  power state, it can be:
 *              - ENABLE: Power
 *              - DISABLE: Powered down
 **********************************************************************/
FunctionalState SYSCON_GetPowerSta (uint32_t block)
{
    FunctionalState powerSta = DISABLE; 
    if(LPC_SYSCON->PDRUNCFG & (block & SYSCON_ABLOCK_BITMASK)) {
        powerSta = DISABLE;
    } else {
        powerSta = ENABLE;
    }

    return powerSta;
}

/*********************************************************************//**
 * @brief      Indicate the state the chip must enter when the Deep-sleep 
 *             mode is asserted by the ARM.
 * @param[in]  block   Analog block, it can be
 *              - SYSCON_ABLOCK_IRCOUT : IRC oscillator output wake-up configuration
 *              - SYSCON_ABLOCK_IRC    : IRC oscillator power-down wake-up configuration 
 *              - SYSCON_ABLOCK_FLASH  : Flash wake-up configuration
 *              - SYSCON_ABLOCK_BOD    : BOD wake-up configuration
 *              - SYSCON_ABLOCK_ADC    : ADC wake-up configuration
 *              - SYSCON_ABLOCK_SYSOSC : System oscillator wake-up configuration
 *              - SYSCON_ABLOCK_WDTOSC : Watchdog oscillator wake-up configuration
 *              - SYSCON_ABLOCK_SYSPLL : System PLL wake-up configuration
 *              - SYSCON_ABLOCK_USBPAD : USB PLL wake-up configuration
 *              - SYSCON_ABLOCK_USBPLL : USB pad wake-up configuration
 * @param[in]  NewState  power state, it can be:
 *              - ENABLE: Powered in Deep-sleep mode
 *              - DISABLE: Powered down in Deep-sleep mode
 *             
 * @return     None
 **********************************************************************/
void SYSCON_DeepSleepPowerCon (uint32_t block, FunctionalState NewState)
{    
    uint32_t reg;

    reg = LPC_SYSCON->PDSLEEPCFG & SYSCON_ABLOCK_BITMASK;
    reg |= 0x800;

    if (NewState == ENABLE) {
        LPC_SYSCON->PDSLEEPCFG = reg & ((~block) & SYSCON_ABLOCK_BITMASK);
    } else if (NewState == DISABLE) {
        LPC_SYSCON->PDSLEEPCFG = reg | (block & SYSCON_ABLOCK_BITMASK);
    }   
}

/*********************************************************************//**
 * @brief      Indicate the state the chip must enter when 
 *             it is waking up from Deep-sleep mode.
 * @param[in]  block   Analog block, it can be
 *              - SYSCON_ABLOCK_IRCOUT : IRC oscillator output wake-up configuration
 *              - SYSCON_ABLOCK_IRC    : IRC oscillator power-down wake-up configuration 
 *              - SYSCON_ABLOCK_FLASH  : Flash wake-up configuration
 *              - SYSCON_ABLOCK_BOD    : BOD wake-up configuration
 *              - SYSCON_ABLOCK_ADC    : ADC wake-up configuration
 *              - SYSCON_ABLOCK_SYSOSC : System oscillator wake-up configuration
 *              - SYSCON_ABLOCK_WDTOSC : Watchdog oscillator wake-up configuration
 *              - SYSCON_ABLOCK_SYSPLL : System PLL wake-up configuration
 *              - SYSCON_ABLOCK_USBPAD : USB PLL wake-up configuration
 *              - SYSCON_ABLOCK_USBPLL : USB pad wake-up configuration
 * @param[in]  NewState  power state, it can be:
 *              - ENABLE: Powered
 *              - DISABLE: Powered down
 *             
 * @return     None
 **********************************************************************/
void SYSCON_WakeupPowerCon (uint32_t block, FunctionalState NewState)
{
    uint32_t reg;

    reg = LPC_SYSCON->PDAWAKECFG & SYSCON_ABLOCK_BITMASK;
    reg |= 0x800;

    if (NewState == ENABLE) {
        LPC_SYSCON->PDAWAKECFG = reg & ((~block) & SYSCON_ABLOCK_BITMASK);
    } else if (NewState == DISABLE) {
        LPC_SYSCON->PDAWAKECFG = reg | (block & SYSCON_ABLOCK_BITMASK);
    }
}


/*********************************************************************//**
 * @brief      Get WDT oscillator freq
 * @param[in]  None
 *             
 * @return     WDT oscillator freq
 **********************************************************************/
uint32_t SYSCON_GetWDTOsc(void)
{
    uint32_t sel;
    uint32_t freq;

    sel = LPC_SYSCON->WDTOSCCTRL;

    switch ((sel>>5) & 0xF) {
    case 0x0:
        freq = 0; break;
    case 0x1:
        freq = 500000; break;
    case 0x2:
        freq = 800000; break;
    case 0x3:
        freq = 1100000; break;
    case 0x4:
        freq = 1400000; break;
    case 0x5:
        freq = 1600000; break;  
    case 0x6:
        freq = 1800000; break;  
    case 0x7:
        freq = 2000000; break;  
    case 0x8:
        freq = 2200000; break;  
    case 0x9:
        freq = 2400000; break;  
    case 0xA:
        freq = 2600000; break;  
    case 0xB:
        freq = 2700000; break;  
    case 0xC:
        freq = 2900000; break;  
    case 0xD:
        freq = 3100000; break;  
    case 0xE:
        freq = 3200000; break;  
    case 0xF:
        freq = 3400000; break;  
    }

