pbosman89/Wordclock/lpc13xx_lib/source/lpc13xx_syscon.c
    freq = freq / (((sel&0x1F)+1) * 2);

    return freq;
}


/*********************************************************************//**
 * @brief      Edge select for start logic input
 * @param[in]  pins the selected start logic inputs, it can be:
 *                    - START_LOGIC_PIO0_0
 *                    - START_LOGIC_PIO0_1
 *                    - START_LOGIC_PIO0_2
 *                    - START_LOGIC_PIO0_3
 *                    - START_LOGIC_PIO0_4
 *                    - START_LOGIC_PIO0_5
 *                    - START_LOGIC_PIO0_6
 *                    - START_LOGIC_PIO0_7
 *                    - START_LOGIC_PIO0_8
 *                    - START_LOGIC_PIO0_9
 *                    - START_LOGIC_PIO0_10
 *                    - START_LOGIC_PIO0_11
 *                    - START_LOGIC_PIO1_0
 * @param[in]  edge Falling or rising edge on the corresponding PIO 
 *                  input, it can be:
 *                    - START_LOGIC_EDGE_Falling : Falling edge
 *                    _ START_LOGIC_EDGE_Rising  : Rising edge
 *             
 * @return  None
 **********************************************************************/
void SYSCON_StartLogicEdge(uint32_t pins, START_LOGIC_INPUT_EDGE edge)
{
    if(edge == START_LOGIC_EDGE_Falling) {
        LPC_SYSCON->STARTAPRP0 &= (~pins) & PARAM_START_LOGIC_MASK;
    } else if(edge == START_LOGIC_EDGE_Rising){
        LPC_SYSCON->STARTAPRP0 |= pins & PARAM_START_LOGIC_MASK;
    }       
}


/*********************************************************************//**
 * @brief      Enable or disable start signal for start logic input
 * @param[in]  pins the selected start logic inputs, it can be:
 *                    - START_LOGIC_PIO0_0
 *                    - START_LOGIC_PIO0_1
 *                    - START_LOGIC_PIO0_2
 *                    - START_LOGIC_PIO0_3
 *                    - START_LOGIC_PIO0_4
 *                    - START_LOGIC_PIO0_5
 *                    - START_LOGIC_PIO0_6
 *                    - START_LOGIC_PIO0_7
 *                    - START_LOGIC_PIO0_8
 *                    - START_LOGIC_PIO0_9
 *                    - START_LOGIC_PIO0_10
 *                    - START_LOGIC_PIO0_11
 *                    - START_LOGIC_PIO1_0
 * @param[in]  cmd  Enable or disable start signal for start logic input
 *                  it can be:
 *                    - ENABLE  : Enable start signal for corresponding 
 *                                start logic input
 *                    _ DISABLE : Disable start signal for corresponding 
 *                                start logic input
 *             
 * @return  None
 **********************************************************************/
void SYSCON_StartLogicCmd(uint32_t pins, FunctionalState cmd)
{
    if(cmd == DISABLE) {
        LPC_SYSCON->STARTERP0 &= (~pins) & PARAM_START_LOGIC_MASK; 
    } else if(cmd == ENABLE) {
        LPC_SYSCON->STARTERP0 |= pins & PARAM_START_LOGIC_MASK;     
    }   
}

/*********************************************************************//**
 * @brief      Start signal reset for start logic input
 * @param[in]  pins the selected start logic inputs, it can be:
 *                    - START_LOGIC_PIO0_0
 *                    - START_LOGIC_PIO0_1
 *                    - START_LOGIC_PIO0_2
 *                    - START_LOGIC_PIO0_3
 *                    - START_LOGIC_PIO0_4
 *                    - START_LOGIC_PIO0_5
 *                    - START_LOGIC_PIO0_6
 *                    - START_LOGIC_PIO0_7
 *                    - START_LOGIC_PIO0_8
 *                    - START_LOGIC_PIO0_9
 *                    - START_LOGIC_PIO0_10
 *                    - START_LOGIC_PIO0_11
 *                    - START_LOGIC_PIO1_0
 *             
 * @return  None
 **********************************************************************/
void SYSCON_StartLogicReset(uint32_t pins)
{
    LPC_SYSCON->STARTRSRP0CLR = pins &  PARAM_START_LOGIC_MASK;
}


/*********************************************************************//**
 * @brief      Get start signal status for start logic input 
 * @param[in]  None
 *             
 * @return  the status of START_LOGIC_PIO0_0 - START_LOGIC_PIO1_0, it 
 *          reflects the status of the enabled start signal bits, The 
 *           bit assignment is
 *                    - Bit  0 : START_LOGIC_PIO0_0
 *                    - Bit  1 : START_LOGIC_PIO0_1
 *                    - Bit  2 : START_LOGIC_PIO0_2
 *                    - Bit  3 : START_LOGIC_PIO0_3
 *                    - Bit  4 : START_LOGIC_PIO0_4
 *                    - Bit  5 : START_LOGIC_PIO0_5
 *                    - Bit  6 : START_LOGIC_PIO0_6
 *                    - Bit  7 : START_LOGIC_PIO0_7
 *                    - Bit  8 : START_LOGIC_PIO0_8
 *                    - Bit  9 : START_LOGIC_PIO0_9
 *                    - Bit 10 : START_LOGIC_PIO0_10
 *                    - Bit 11 : START_LOGIC_PIO0_11
 *                    - Bit 12 : START_LOGIC_PIO1_0
 **********************************************************************/
uint32_t SYSCON_StartLogicStatus(void)
{
    return (LPC_SYSCON->STARTSRP0 & PARAM_START_LOGIC_MASK);
}

/*********************************************************************//**
 * @brief      Get AHB Clock
 * @param[in]  None
 *             
 * @return     WDT Clock
 **********************************************************************/
uint32_t SYSCON_GetAHBClock(void)
{
    if(SYSCON_GetAHBClockDiv() == 0) {
        return 0;
    } else {
        return (SystemFrequency/SYSCON_GetAHBClockDiv());
    }
}

/*********************************************************************//**
 * @brief      Get WDT Clock
 * @param[in]  None
 *             
 * @return     WDT Clock
 **********************************************************************/
uint32_t SYSCON_GetWDTClock(void)
{
    uint32_t sel;
    uint32_t freq;   

    sel = LPC_SYSCON->WDTCLKSEL & 0x3;
    switch (sel) {
        case 0:     // IRC oscillator
            freq = IRC_OSC_FREQ; break;     
        case 1:     // Main clock
            freq = SystemFrequency; break;            
        case 2:     // Watchdog oscillator
            freq = SYSCON_GetWDTOsc(); break;   
        case 3:     // Reserved
            freq = 0;
    } 
   
    sel = SYSCON_GetWDTClockDiv();
    
    if(sel == 0) {
        freq = 0;
    } else {
        freq /= sel;
    }
    
    return freq;     
}

/*********************************************************************//**
 * @brief      Get SSP0 or SSP1 Clock
 *             
 * @return     SSP Clock
 **********************************************************************/
uint32_t SYSCON_GetSSPClock(void)
{
    uint32_t div = 0;

    div = SYSCON_GetSPIClockDiv();

    if (div == 0) {
        return 0;
    } else {
        return (SystemFrequency/div);
    }
}

/*********************************************************************//**
 * @brief      Get UART Clock
 * @param[in]  None
 *             
 * @return     UART Clock
 **********************************************************************/
uint32_t SYSCON_GetUARTClock(void)
{
    uint32_t div = 0;

    div = SYSCON_GetUARTClockDiv();
   
    if (div == 0) {
        return 0;
    } else {
        return (SystemFrequency/div);
    }
}

/**
 * @}
 */

#endif

/**
 * @}
 */
/* --------------------------------- End Of File ------------------------------ */
